<template>
  <div>
    <QCard class="shadow-none bg-background-primary min-h-120 pa-sm">
      <QScrollArea style="height: 30rem">
        <div class="grid lg:grid-cols-2 gap-3 px-4" v-auto-animate>
          <Notification
            v-for="item in unfilteredNotifications"
            :name="item.name"
            :description="item.description"
            @close="item.disabled = true"
          />
        </div>
      </QScrollArea>
    </QCard>
  </div>
</template>

<script setup lang="ts">
const notifications = ref([
  {
    name: 'همین الان اقدام به خرید کن !',
    description:
      'شما می توانید در اولین خرید خود در فروشگاه حداقل مبلغ ۲۵۰ هزار تومان تخفیف از ما دریافت کنید.',
    id: 1,
    disabled: false
  },
  {
    name: 'همین الان اقدام به خرید کن !',
    description:
      'شما می توانید در اولین خرید خود در فروشگاه حداقل مبلغ ۲۵۰ هزار تومان تخفیف از ما دریافت کنید.',
    id: 2,
    disabled: false
  },
  {
    name: 'خرید خود را امروز بکنید!',
    description:
      'فقط امروز شما می توانید با خرید محصولات مورد علاقه‌تان، تخفیف ویژه‌ای دریافت کنید.',
    id: 3,
    disabled: false
  },
  {
    name: 'فقط تا فردا!',
    description:
      'شما تا فردا فرصت دارید تا با خرید محصولات مورد علاقه‌تان، از تخفیف ویژه بهره‌مند شوید.',
    id: 4,
    disabled: false
  },
  {
    name: 'پیشنهاد ویژه برای شما!',
    description:
      'برای شما پیشنهاد ویژه‌ای داریم! با خرید محصولات مورد علاقه‌تان، از تخفیف ویژه بهره‌مند شوید.',
    id: 5,
    disabled: false
  },
  {
    name: 'همین الان اقدام به خرید کن !',
    description:
      'شما می توانید در اولین خرید خود در فروشگاه حداقل مبلغ ۲۵۰ هزار تومان تخفیف از ما دریافت کنید.',
    id: 1,
    disabled: false
  },
  {
    name: 'همین الان اقدام به خرید کن !',
    description:
      'شما می توانید در اولین خرید خود در فروشگاه حداقل مبلغ ۲۵۰ هزار تومان تخفیف از ما دریافت کنید.',
    id: 2,
    disabled: false
  },
  {
    name: 'خرید خود را امروز بکنید!',
    description:
      'فقط امروز شما می توانید با خرید محصولات مورد علاقه‌تان، تخفیف ویژه‌ای دریافت کنید.',
    id: 3,
    disabled: false
  },
  {
    name: 'فقط تا فردا!',
    description:
      'شما تا فردا فرصت دارید تا با خرید محصولات مورد علاقه‌تان، از تخفیف ویژه بهره‌مند شوید.',
    id: 4,
    disabled: false
  },
  {
    name: 'پیشنهاد ویژه برای شما!',
    description:
      'برای شما پیشنهاد ویژه‌ای داریم! با خرید محصولات مورد علاقه‌تان، از تخفیف ویژه بهره‌مند شوید.',
    id: 5,
    disabled: false
  },
  {
    name: 'همین الان اقدام به خرید کن !',
    description:
      'شما می توانید در اولین خرید خود در فروشگاه حداقل مبلغ ۲۵۰ هزار تومان تخفیف از ما دریافت کنید.',
    id: 1,
    disabled: false
  },
  {
    name: 'همین الان اقدام به خرید کن !',
    description:
      'شما می توانید در اولین خرید خود در فروشگاه حداقل مبلغ ۲۵۰ هزار تومان تخفیف از ما دریافت کنید.',
    id: 2,
    disabled: false
  },
  {
    name: 'خرید خود را امروز بکنید!',
    description:
      'فقط امروز شما می توانید با خرید محصولات مورد علاقه‌تان، تخفیف ویژه‌ای دریافت کنید.',
    id: 3,
    disabled: false
  },
  {
    name: 'فقط تا فردا!',
    description:
      'شما تا فردا فرصت دارید تا با خرید محصولات مورد علاقه‌تان، از تخفیف ویژه بهره‌مند شوید.',
    id: 4,
    disabled: false
  },
  {
    name: 'پیشنهاد ویژه برای شما!',
    description:
      'برای شما پیشنهاد ویژه‌ای داریم! با خرید محصولات مورد علاقه‌تان، از تخفیف ویژه بهره‌مند شوید.',
    id: 5,
    disabled: false
  },
  {
    name: 'همین الان اقدام به خرید کن !',
    description:
      'شما می توانید در اولین خرید خود در فروشگاه حداقل مبلغ ۲۵۰ هزار تومان تخفیف از ما دریافت کنید.',
    id: 1,
    disabled: false
  },
  {
    name: 'همین الان اقدام به خرید کن !',
    description:
      'شما می توانید در اولین خرید خود در فروشگاه حداقل مبلغ ۲۵۰ هزار تومان تخفیف از ما دریافت کنید.',
    id: 2,
    disabled: false
  },
  {
    name: 'خرید خود را امروز بکنید!',
    description:
      'فقط امروز شما می توانید با خرید محصولات مورد علاقه‌تان، تخفیف ویژه‌ای دریافت کنید.',
    id: 3,
    disabled: false
  },
  {
    name: 'فقط تا فردا!',
    description:
      'شما تا فردا فرصت دارید تا با خرید محصولات مورد علاقه‌تان، از تخفیف ویژه بهره‌مند شوید.',
    id: 4,
    disabled: false
  },
  {
    name: 'پیشنهاد ویژه برای شما!',
    description:
      'برای شما پیشنهاد ویژه‌ای داریم! با خرید محصولات مورد علاقه‌تان، از تخفیف ویژه بهره‌مند شوید.',
    id: 5,
    disabled: false
  },
  {
    name: 'همین الان اقدام به خرید کن !',
    description:
      'شما می توانید در اولین خرید خود در فروشگاه حداقل مبلغ ۲۵۰ هزار تومان تخفیف از ما دریافت کنید.',
    id: 1,
    disabled: false
  },
  {
    name: 'همین الان اقدام به خرید کن !',
    description:
      'شما می توانید در اولین خرید خود در فروشگاه حداقل مبلغ ۲۵۰ هزار تومان تخفیف از ما دریافت کنید.',
    id: 2,
    disabled: false
  },
  {
    name: 'خرید خود را امروز بکنید!',
    description:
      'فقط امروز شما می توانید با خرید محصولات مورد علاقه‌تان، تخفیف ویژه‌ای دریافت کنید.',
    id: 3,
    disabled: false
  },
  {
    name: 'فقط تا فردا!',
    description:
      'شما تا فردا فرصت دارید تا با خرید محصولات مورد علاقه‌تان، از تخفیف ویژه بهره‌مند شوید.',
    id: 4,
    disabled: false
  },
  {
    name: 'پیشنهاد ویژه برای شما!',
    description:
      'برای شما پیشنهاد ویژه‌ای داریم! با خرید محصولات مورد علاقه‌تان، از تخفیف ویژه بهره‌مند شوید.',
    id: 5,
    disabled: false
  },
  {
    name: 'همین الان اقدام به خرید کن !',
    description:
      'شما می توانید در اولین خرید خود در فروشگاه حداقل مبلغ ۲۵۰ هزار تومان تخفیف از ما دریافت کنید.',
    id: 1,
    disabled: false
  },
  {
    name: 'همین الان اقدام به خرید کن !',
    description:
      'شما می توانید در اولین خرید خود در فروشگاه حداقل مبلغ ۲۵۰ هزار تومان تخفیف از ما دریافت کنید.',
    id: 2,
    disabled: false
  },
  {
    name: 'خرید خود را امروز بکنید!',
    description:
      'فقط امروز شما می توانید با خرید محصولات مورد علاقه‌تان، تخفیف ویژه‌ای دریافت کنید.',
    id: 3,
    disabled: false
  },
  {
    name: 'فقط تا فردا!',
    description:
      'شما تا فردا فرصت دارید تا با خرید محصولات مورد علاقه‌تان، از تخفیف ویژه بهره‌مند شوید.',
    id: 4,
    disabled: false
  },
  {
    name: 'پیشنهاد ویژه برای شما!',
    description:
      'برای شما پیشنهاد ویژه‌ای داریم! با خرید محصولات مورد علاقه‌تان، از تخفیف ویژه بهره‌مند شوید.',
    id: 5,
    disabled: false
  },
  {
    name: 'همین الان اقدام به خرید کن !',
    description:
      'شما می توانید در اولین خرید خود در فروشگاه حداقل مبلغ ۲۵۰ هزار تومان تخفیف از ما دریافت کنید.',
    id: 1,
    disabled: false
  },
  {
    name: 'همین الان اقدام به خرید کن !',
    description:
      'شما می توانید در اولین خرید خود در فروشگاه حداقل مبلغ ۲۵۰ هزار تومان تخفیف از ما دریافت کنید.',
    id: 2,
    disabled: false
  },
  {
    name: 'خرید خود را امروز بکنید!',
    description:
      'فقط امروز شما می توانید با خرید محصولات مورد علاقه‌تان، تخفیف ویژه‌ای دریافت کنید.',
    id: 3,
    disabled: false
  },
  {
    name: 'فقط تا فردا!',
    description:
      'شما تا فردا فرصت دارید تا با خرید محصولات مورد علاقه‌تان، از تخفیف ویژه بهره‌مند شوید.',
    id: 4,
    disabled: false
  },
  {
    name: 'پیشنهاد ویژه برای شما!',
    description:
      'برای شما پیشنهاد ویژه‌ای داریم! با خرید محصولات مورد علاقه‌تان، از تخفیف ویژه بهره‌مند شوید.',
    id: 5,
    disabled: false
  },
  {
    name: 'همین الان اقدام به خرید کن !',
    description:
      'شما می توانید در اولین خرید خود در فروشگاه حداقل مبلغ ۲۵۰ هزار تومان تخفیف از ما دریافت کنید.',
    id: 1,
    disabled: false
  },
  {
    name: 'همین الان اقدام به خرید کن !',
    description:
      'شما می توانید در اولین خرید خود در فروشگاه حداقل مبلغ ۲۵۰ هزار تومان تخفیف از ما دریافت کنید.',
    id: 2,
    disabled: false
  },
  {
    name: 'خرید خود را امروز بکنید!',
    description:
      'فقط امروز شما می توانید با خرید محصولات مورد علاقه‌تان، تخفیف ویژه‌ای دریافت کنید.',
    id: 3,
    disabled: false
  },
  {
    name: 'فقط تا فردا!',
    description:
      'شما تا فردا فرصت دارید تا با خرید محصولات مورد علاقه‌تان، از تخفیف ویژه بهره‌مند شوید.',
    id: 4,
    disabled: false
  },
  {
    name: 'پیشنهاد ویژه برای شما!',
    description:
      'برای شما پیشنهاد ویژه‌ای داریم! با خرید محصولات مورد علاقه‌تان، از تخفیف ویژه بهره‌مند شوید.',
    id: 5,
    disabled: false
  },
  {
    name: 'همین الان اقدام به خرید کن !',
    description:
      'شما می توانید در اولین خرید خود در فروشگاه حداقل مبلغ ۲۵۰ هزار تومان تخفیف از ما دریافت کنید.',
    id: 1,
    disabled: false
  },
  {
    name: 'همین الان اقدام به خرید کن !',
    description:
      'شما می توانید در اولین خرید خود در فروشگاه حداقل مبلغ ۲۵۰ هزار تومان تخفیف از ما دریافت کنید.',
    id: 2,
    disabled: false
  },
  {
    name: 'خرید خود را امروز بکنید!',
    description:
      'فقط امروز شما می توانید با خرید محصولات مورد علاقه‌تان، تخفیف ویژه‌ای دریافت کنید.',
    id: 3,
    disabled: false
  },
  {
    name: 'فقط تا فردا!',
    description:
      'شما تا فردا فرصت دارید تا با خرید محصولات مورد علاقه‌تان، از تخفیف ویژه بهره‌مند شوید.',
    id: 4,
    disabled: false
  },
  {
    name: 'پیشنهاد ویژه برای شما!',
    description:
      'برای شما پیشنهاد ویژه‌ای داریم! با خرید محصولات مورد علاقه‌تان، از تخفیف ویژه بهره‌مند شوید.',
    id: 5,
    disabled: false
  },
  {
    name: 'همین الان اقدام به خرید کن !',
    description:
      'شما می توانید در اولین خرید خود در فروشگاه حداقل مبلغ ۲۵۰ هزار تومان تخفیف از ما دریافت کنید.',
    id: 1,
    disabled: false
  },
  {
    name: 'همین الان اقدام به خرید کن !',
    description:
      'شما می توانید در اولین خرید خود در فروشگاه حداقل مبلغ ۲۵۰ هزار تومان تخفیف از ما دریافت کنید.',
    id: 2,
    disabled: false
  },
  {
    name: 'خرید خود را امروز بکنید!',
    description:
      'فقط امروز شما می توانید با خرید محصولات مورد علاقه‌تان، تخفیف ویژه‌ای دریافت کنید.',
    id: 3,
    disabled: false
  },
  {
    name: 'فقط تا فردا!',
    description:
      'شما تا فردا فرصت دارید تا با خرید محصولات مورد علاقه‌تان، از تخفیف ویژه بهره‌مند شوید.',
    id: 4,
    disabled: false
  },
  {
    name: 'پیشنهاد ویژه برای شما!',
    description:
      'برای شما پیشنهاد ویژه‌ای داریم! با خرید محصولات مورد علاقه‌تان، از تخفیف ویژه بهره‌مند شوید.',
    id: 5,
    disabled: false
  }
])

const unfilteredNotifications = computed(() =>
  notifications.value.filter(el => !el.disabled)
)
</script>
