<template>
  <div class="mt-5rem relative space-y-xl">
    <div class="flex">
      <div class="flex-1 space-y-xl">
        <!-- blog svg icon -->
        <div class="flex items-center gap-3">
          <svg
            width="35"
            height="35"
            viewBox="0 0 24 24"
            fill="none"
            xmlns="http://www.w3.org/2000/svg"
          >
            <path
              opacity="0.4"
              d="M21 7V17C21 20 19.5 22 16 22H8C4.5 22 3 20 3 17V7C3 4 4.5 2 8 2H16C19.5 2 21 4 21 7Z"
              fill="#007AFF"
            />
            <path
              d="M18.5 9.25H16.5C14.98 9.25 13.75 8.02 13.75 6.5V4.5C13.75 4.09 14.09 3.75 14.5 3.75C14.91 3.75 15.25 4.09 15.25 4.5V6.5C15.25 7.19 15.81 7.75 16.5 7.75H18.5C18.91 7.75 19.25 8.09 19.25 8.5C19.25 8.91 18.91 9.25 18.5 9.25Z"
              fill="#007AFF"
            />
            <path
              d="M12 13.75H8C7.59 13.75 7.25 13.41 7.25 13C7.25 12.59 7.59 12.25 8 12.25H12C12.41 12.25 12.75 12.59 12.75 13C12.75 13.41 12.41 13.75 12 13.75Z"
              fill="#007AFF"
            />
            <path
              d="M16 17.75H8C7.59 17.75 7.25 17.41 7.25 17C7.25 16.59 7.59 16.25 8 16.25H16C16.41 16.25 16.75 16.59 16.75 17C16.75 17.41 16.41 17.75 16 17.75Z"
              fill="#007AFF"
            />
          </svg>

          <h4 class="text_header heading">وبلاگ</h4>
        </div>
        <p class="text-text-secondary max-w-65ch">
          لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با
          استفاده از طراحان گرافیک است،
        </p>
      </div>
    </div>

    <div class="w-full">
      <Slider
        :loop="false"
        slider-class=""
        class="mx-auto !overflow-visible"
        :slides-per-view="1.1"
        :pagination="{
          clickable: true
        }"
        :breakpoints="{
          640: {
            slidesPerView: 1.8
          },
          880: {
            slidesPerView: 2.5
          },
          1200: {
            slidesPerView: 3
          },
          1536: {
            slidesPerView: 3.5
          }
        }"
      >
        <SwiperSlide class="pb-2rem">
          <BlogComponent
            label="شماره موبایل یا ایمیل"
            desc=" لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با
                استفاده از طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و مجله
                در ستون و سطرآنچنان که لازم است، و برای شرایط فعلی تکنولوژی مورد
                نیاز، و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد،"
            time="  ۲ هفته پیش"
            comment-amount="46"
          />
        </SwiperSlide>
        <SwiperSlide class="pb-2rem">
          <BlogComponent
            label="شماره موبایل یا ایمیل"
            desc=" لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با
                استفاده از طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و مجله
                در ستون و سطرآنچنان که لازم است، و برای شرایط فعلی تکنولوژی مورد
                نیاز، و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد،"
            time="  ۲ هفته پیش"
            comment-amount="46"
          />
        </SwiperSlide>
        <SwiperSlide class="pb-2rem">
          <BlogComponent
            label="شماره موبایل یا ایمیل"
            desc=" لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با
                استفاده از طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و مجله
                در ستون و سطرآنچنان که لازم است، و برای شرایط فعلی تکنولوژی مورد
                نیاز، و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد،"
            time="  ۲ هفته پیش"
            comment-amount="46"
          />
        </SwiperSlide>
        <SwiperSlide class="pb-2rem">
          <BlogComponent
            label="شماره موبایل یا ایمیل"
            desc=" لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با
                استفاده از طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و مجله
                در ستون و سطرآنچنان که لازم است، و برای شرایط فعلی تکنولوژی مورد
                نیاز، و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد،"
            time="  ۲ هفته پیش"
            comment-amount="46"
          />
        </SwiperSlide>
        <SwiperSlide class="pb-2rem">
          <BlogComponent
            label="شماره موبایل یا ایمیل"
            desc=" لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با
                استفاده از طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و مجله
                در ستون و سطرآنچنان که لازم است، و برای شرایط فعلی تکنولوژی مورد
                نیاز، و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد،"
            time="  ۲ هفته پیش"
            comment-amount="46"
          />
        </SwiperSlide>
        <SwiperSlide class="pb-2rem">
          <BlogComponent
            label="شماره موبایل یا ایمیل"
            desc=" لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با
                استفاده از طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و مجله
                در ستون و سطرآنچنان که لازم است، و برای شرایط فعلی تکنولوژی مورد
                نیاز، و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد،"
            time="  ۲ هفته پیش"
            comment-amount="46"
          />
        </SwiperSlide>
        <SwiperSlide class="pb-2rem">
          <BlogComponent
            label="شماره موبایل یا ایمیل"
            desc=" لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با
                استفاده از طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و مجله
                در ستون و سطرآنچنان که لازم است، و برای شرایط فعلی تکنولوژی مورد
                نیاز، و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد،"
            time="  ۲ هفته پیش"
            comment-amount="46"
          />
        </SwiperSlide>
        <SwiperSlide class="pb-2rem">
          <BlogComponent
            label="شماره موبایل یا ایمیل"
            desc=" لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با
                استفاده از طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و مجله
                در ستون و سطرآنچنان که لازم است، و برای شرایط فعلی تکنولوژی مورد
                نیاز، و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد،"
            time="  ۲ هفته پیش"
            comment-amount="46"
          />
        </SwiperSlide>
      </Slider>
    </div>
  </div>
</template>

<script setup>
// TODO THis is Important
import { useQuasar } from 'quasar'
const $q = useQuasar()
const colorFromScriptSetup = ref($q.dark.isActive ? '#121212' : '#fff')
</script>
<style>
.swiper-pagination {
  /* ... other styles ... */
  /* bottom: -10px !important; */
}
</style>
