<script setup lang="ts"></script>
<template>
  <main>
    <section class="row q-col-gutter-lg pb-lg">
      <div class="col-12 mt-2rem mb-3rem">
        <h3 class="text-2xl py-lg">
          ما چگونه از سالم بودن دسته شما مطمئن می شویم؟
        </h3>
        <p v-for="i in 2" class="text-text-secondary">
          لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با
          استفاده از طراحان گرافیک است، لورم ایپسوم متن ساختگی با تولید سادگی
          نامفهوم از صنعت چاپ، و با استفاده از طراحان گرافیک است، لورم ایپسوم
          متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان
          گرافیک است، لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ،
          و با استفاده از طراحان گرافیک است، لورم ایپسوم متن ساختگی با تولید
          سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان گرافیک است، لورم
          ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از
          طراحان گرافیک است، لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از
          صنعت چاپ، و با استفاده از طراحان گرافیک است، لورم ایپسوم متن ساختگی با
          تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان گرافیک است،
        </p>
      </div>
    </section>
  </main>
</template>
<route lang="yaml">
meta:
  currentPageName: خدمات تعمیر - تست خرابی دسته
</route>
